app/Controllers/Admin.php

SELECT *
FROM `tb_telemetri`
WHERE `nama_lokasi` IN ('AWLR MATAIYANG','AWLR SAMPIR','AWLR MENEMENG')
---

        // Tambahkan: Ambil data AWLR Sungai (MataiYANG, Sampir, Menemeng) dari database
        $db = \Config\Database::connect();
        $awlrSungaiList = $db->table('tb_telemetri')
            ->whereIn('nama_lokasi', [
                'AWLR MATAIYANG',
                'AWLR SAMPIR',
                'AWLR MENEMENG'
            ])
            ->get()
            ->getResultArray();