app/Controllers/Home.php

SELECT *
FROM `tb_telemetri`
---
    public function getTelemetriGeoJSON()
    {
        $model = new \App\Models\TelemetriModel();
        $data = $model->findAll();