app/Controllers/Home.php

    public function getTelemetriGeoJSON()
    {
        $model = new \App\Models\TelemetriModel();

        // Ambil hanya yang status = 'aktif'
        $data = $model->where('status', 'aktif')->findAll();
---
SELECT *
FROM `tb_telemetri`
WHERE `status` = 'aktif'