app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = '21232f297a57a5a743894a0e4a801fc3'
 LIMIT 1
---
    public function auth()
    {
        $username = $this->request->getPost('username');
        $password = md5($this->request->getPost('password'));

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)
                          ->where('password', $password)
                          ->first();