app/Controllers/TelemetryController.php

    public function getBintangBano()
        {
            $db = \Config\Database::connect();
            $data = $db->table('tb_telemetri')
                    ->where('id', 10080)
                    ->select('waktu, tma')
                    ->get()
                    ->getRowArray();
---
SELECT `waktu`, `tma`
FROM `tb_telemetri`
WHERE `id` = 10080

    public function getTiuSuntuk()
        {
            $db = \Config\Database::connect();
            $data = $db->table('tb_telemetri')
                    ->where('id', 10187)
                    ->select('waktu, tma')
                    ->get()
                    ->getRowArray();
---
SELECT `waktu`, `tma`
FROM `tb_telemetri`
WHERE `id` = 10187